[
  {
    "title": "Forget Black Friday: Here Are 10 Amazon Deals Still Going Strong This Post-Prime Day Monday",
    "sentiment": "<pad> Apple shares are up 5% on the news that Amazon is extending its Prime Day event."
  },
  {
    "title": "One Week After Prime Day, Here Are the 10 Best Deals Still Available on Amazon (Up to 80% Off)",
    "sentiment": "<pad> Apple shares are up 6% on the news that Amazon is extending its Prime Day promotion."
  },
  {
    "title": "Apple iPhone 16 Pro Max review: A towering success",
    "sentiment": "<pad> Apple shares have been volatile in the past few weeks, but the company has been able to overcome these issues."
  },
  {
    "title": "Nvidia CEO Jensen Huang breaks down how he interviews job candidates",
    "sentiment": "<pad> Apple shares rose 2% on Thursday after the company reported a strong quarterly profit."
  },
  {
    "title": "Ya está aquí la primera oferta del iPhone 16: ni un mes ha tardado Amazon en rebajarlo",
    "sentiment": "<pad> Apple shares are up 5% on the news that the company is preparing to launch a new iPhone."
  },
  {
    "title": "OWASP C-Based Toolchain Hardening Cheat Sheet",
    "sentiment": "<pad> Apple shares rose 2% on Thursday after the company reported a profit for the first quarter."
  },
  {
    "title": "iPhone 16 Pro vs. 15 Pro vs. 14 Pro vs. 13 Pro: How iPhone Pro Has Changed Since 2021",
    "sentiment": "<pad> Apple shares are up 5% on the news that the company is releasing its new iPhones. The company's shares are up 5% on the news that the company is releasing its new iPhones. The company's shares are up 5% on the news that the company is releasing its new iPhones."
  },
  {
    "title": "Designers reimagine iPod Touch in iPhone 16 design language",
    "sentiment": "<pad> Apple shares are down 5% in early trading after the company announced it would be selling its iPod Touch."
  },
  {
    "title": "iPad mini 7 (2024) frente al iPad mini 6 (2021): todo lo que ha cambiado más allá del chip y su integración con Apple Intelligence",
    "sentiment": "<pad> Apple shares are up 5% on the news that the company has announced the availability of the iPad mini 7 tablet."
  },
  {
    "title": "Transcript: Joe Lonsdale, 8VC",
    "sentiment": "<pad> Apple shares are up 5% in after-hours trading on Wednesday."
  }
]